tap "1password/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "kreuzwerker/taps"
tap "planetscale/tap"
tap "remind101/formulae"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Open source relational database management system
brew "mysql-client"
# Platform built on V8 to build network applications
brew "node"
# Fast, disk space efficient package manager
brew "pnpm"
# Command-line interface for SQLite
brew "sqlite"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to manage software development and track bugs
cask "linear-linear"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "atlassian.atlascode"
vscode "benjaminbenais.copilot-theme"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "honnamkuan.golang-snippets"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-scss"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rianadon.vscode-java-checkstyle"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "ue.alphabetical-sorter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.console-ninja"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
