tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kreuzwerker/taps"
tap "lokalise/cli-2"
tap "planetscale/tap"
tap "remind101/formulae"
tap "withgraphite/tap"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open source relational database management system
brew "mysql-client"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# CLI to support with downloading and compiling terraform providers for Mac with M1 chip.
brew "kreuzwerker/taps/m1-terraform-provider-helper"
# Lokalise CLI v2
brew "lokalise/cli-2/lokalise2"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Chromium based browser
cask "arc"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to manage software development and track bugs
cask "linear-linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
